<a href="https://colab.research.google.com/github/StanleyLiangYork/PythonDatabase/blob/master/SQL_in_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Install PandaSQL

In [1]:
!pip install pandasql

Collecting pandasql
  Downloading https://files.pythonhosted.org/packages/6b/c4/ee4096ffa2eeeca0c749b26f0371bd26aa5c8b611c43de99a4f86d3de0a7/pandasql-0.7.3.tar.gz
Requirement already satisfied: numpy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.17.5)
Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (from pandasql) (0.25.3)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.3.13)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2.6.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas->pandasql) (1.12.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-cp36-none-any.whl size=26819 sha256=b1e9545993b72469a7bd12d8ea0440949fe6b581efd5eeb50f9e7bfbc257d990
  Stored in directory: /root/.cache/pip/wheels/53/6c/18/b87a2e5fa8a82e9c026311de56210b8d1c01846e18a9607fc9
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [0]:
import pandas as pd
from pandasql import sqldf
from random import choice, random, randint

In [0]:
major_choices = ['Math', 'English', 'History', 'Biology', 'Computer Science', 'Chemistry']
year_choices = [1, 2, 3, 4, 5]
major_gpa_avgs = {major:random()+2.5 for major in major_choices}

In [147]:
major_gpa_avgs

{'Biology': 3.3623251265655387,
 'Chemistry': 2.691205845989936,
 'Computer Science': 3.3550542876990996,
 'English': 3.4033497281493634,
 'History': 2.6026469567126407,
 'Math': 3.3945818531575176}

In [0]:
n=10000

names = [' '.join([choice(['Adam', 'Bill', 'Catherine', 'Daniel', 'Ewin', 'Frank', 'George', 'Henry','Gates','Issac']) for _ in range(2) ]) for _ in range(n)]
majors = [choice(major_choices) for _ in range(n)]
gpas = [min(major_gpa_avgs[m]+random()/4.0, 4.0) for m in majors]
years = [choice(year_choices) for _ in range(n)]

student_data = pd.DataFrame(data=zip(names, gpas, majors, years), columns=['Name', 'GPA', 'Major', 'Year'])

In [152]:
student_data

                 Name       GPA             Major  Year
0          Bill Frank  3.449419              Math     5
1       George George  3.633388              Math     3
2          Henry Adam  3.513538  Computer Science     1
3         Adam George  2.746021         Chemistry     5
4          Frank Ewin  2.749638         Chemistry     2
...               ...       ...               ...   ...
9995      Bill Daniel  2.832558         Chemistry     1
9996  Frank Catherine  3.424644           Biology     5
9997       Issac Ewin  3.617497           English     1
9998       Adam Henry  2.784513           History     5
9999    George George  3.463862           Biology     5

[10000 rows x 4 columns]

SELECT

In [153]:
selected_data = sqldf("SELECT  * FROM student_data LIMIT 20;", globals())
print(selected_data)

                Name       GPA             Major  Year
0         Bill Frank  3.449419              Math     5
1      George George  3.633388              Math     3
2         Henry Adam  3.513538  Computer Science     1
3        Adam George  2.746021         Chemistry     5
4         Frank Ewin  2.749638         Chemistry     2
5        George Adam  3.638779           English     3
6         Henry Ewin  3.588737              Math     4
7       George Gates  3.418176              Math     4
8   George Catherine  3.420593           English     2
9         Ewin Gates  3.410863  Computer Science     3
10        Ewin Frank  2.801940         Chemistry     3
11       Issac Gates  3.608756           Biology     5
12       Issac Issac  2.890433         Chemistry     2
13      George Frank  3.438299           English     1
14       Henry Issac  3.449546              Math     1
15        Gates Adam  2.923152         Chemistry     1
16   Gates Catherine  2.795424           History     2
17      Henry Daniel  2.793533           History     5
18       George Adam  3.565537           English     5
19         Adam Ewin  3.610822           Biology     1

In [157]:
cols=['Name', 'GPA', 'Major', 'Year']
col_name = ','.join(cols)
statement = "SELECT " + col_name + " FROM student_data LIMIT 20;"
selected_data = sqldf(statement, globals())
print(selected_data)

                Name       GPA             Major  Year
0         Bill Frank  3.449419              Math     5
1      George George  3.633388              Math     3
2         Henry Adam  3.513538  Computer Science     1
3        Adam George  2.746021         Chemistry     5
4         Frank Ewin  2.749638         Chemistry     2
5        George Adam  3.638779           English     3
6         Henry Ewin  3.588737              Math     4
7       George Gates  3.418176              Math     4
8   George Catherine  3.420593           English     2
9         Ewin Gates  3.410863  Computer Science     3
10        Ewin Frank  2.801940         Chemistry     3
11       Issac Gates  3.608756           Biology     5
12       Issac Issac  2.890433         Chemistry     2
13      George Frank  3.438299           English     1
14       Henry Issac  3.449546              Math     1
15        Gates Adam  2.923152         Chemistry     1
16   Gates Catherine  2.795424           History     2
17      Henry Daniel  2.793533           History     5
18       George Adam  3.565537           English     5
19         Adam Ewin  3.610822           Biology     1

Count

In [162]:
statement = "SELECT  DISTINCT Major FROM student_data;"
selected_data = sqldf(statement, globals())
major_list = list(selected_data['Major'])
print(major_list)

['Math', 'Computer Science', 'Chemistry', 'English', 'Biology', 'History']

In [169]:
statement = "SELECT  COUNT(DISTINCT Major) as count FROM student_data;"
selected_data = sqldf(statement, globals())
major_count = selected_data['count']
print(major_count[0])

6

In [172]:
statement = "SELECT  DISTINCT Major, Year FROM student_data;"
selected_data = sqldf(statement, globals())
print(selected_data)

               Major  Year
0               Math     5
1               Math     3
2   Computer Science     1
3          Chemistry     5
4          Chemistry     2
5            English     3
6               Math     4
7            English     2
8   Computer Science     3
9          Chemistry     3
10           Biology     5
11           English     1
12              Math     1
13         Chemistry     1
14           History     2
15           History     5
16           English     5
17           Biology     1
18           History     4
19  Computer Science     4
20           Biology     3
21         Chemistry     4
22           English     4
23           Biology     2
24           History     3
25  Computer Science     2
26  Computer Science     5
27              Math     2
28           History     1
29           Biology     4

Where statement

In [176]:
statement = "SELECT  GPA FROM student_data WHERE Major = 'History' LIMIT 20;"
selected_data = sqldf(statement, globals())
print(selected_data)

         GPA
0   2.795424
1   2.793533
2   2.680848
3   2.819450
4   2.768629
5   2.807550
6   2.697347
7   2.742180
8   2.614470
9   2.735318
10  2.639549
11  2.733966
12  2.841503
13  2.717357
14  2.839175
15  2.833655
16  2.700817
17  2.830181
18  2.778149
19  2.716602

In [178]:
statement = "SELECT * FROM student_data WHERE Major = 'History' OR Major='English' LIMIT 20;"
selected_data = sqldf(statement, globals())
print(selected_data)

                   Name       GPA    Major  Year
0           George Adam  3.638779  English     3
1      George Catherine  3.420593  English     2
2          George Frank  3.438299  English     1
3       Gates Catherine  2.795424  History     2
4          Henry Daniel  2.793533  History     5
5           George Adam  3.565537  English     5
6      George Catherine  2.680848  History     4
7           Issac Issac  2.819450  History     5
8           Frank Frank  3.455267  English     1
9           Issac Frank  3.423783  English     4
10           Issac Adam  2.768629  History     3
11       Adam Catherine  2.807550  History     4
12          Gates Gates  2.697347  History     2
13          Frank Gates  2.742180  History     3
14  Catherine Catherine  3.480353  English     5
15     George Catherine  3.531265  English     1
16        Daniel George  3.439850  English     2
17         Frank Daniel  2.614470  History     2
18         Frank Daniel  2.735318  History     1
19     Catherine George  3.600754  English     3

In [183]:
statement = "SELECT * FROM student_data WHERE Major = 'History' AND GPA>=2.5 LIMIT 20;"
selected_data = sqldf(statement, globals())
print(selected_data)

                Name       GPA    Major  Year
0    Gates Catherine  2.795424  History     2
1       Henry Daniel  2.793533  History     5
2   George Catherine  2.680848  History     4
3        Issac Issac  2.819450  History     5
4         Issac Adam  2.768629  History     3
5     Adam Catherine  2.807550  History     4
6        Gates Gates  2.697347  History     2
7        Frank Gates  2.742180  History     3
8       Frank Daniel  2.614470  History     2
9       Frank Daniel  2.735318  History     1
10      George Henry  2.639549  History     4
11       Bill George  2.733966  History     2
12         Bill Ewin  2.841503  History     5
13       Gates Frank  2.717357  History     4
14   Issac Catherine  2.839175  History     3
15      George Henry  2.833655  History     1
16       Gates Gates  2.700817  History     5
17       Frank Henry  2.830181  History     4
18       Daniel Bill  2.778149  History     4
19       Daniel Ewin  2.716602  History     4

In [184]:
statement = "SELECT AVG(GPA) as avg_GPA FROM student_data WHERE Major != 'History' AND Year = 4;"
selected_data = sqldf(statement, globals())
print(selected_data)

    avg_GPA
0  3.360704

In [186]:
statement = "SELECT * FROM student_data WHERE Major like '%ry' AND Year = 4 LIMIT 20;"
selected_data = sqldf(statement, globals())
print(selected_data)

                Name       GPA      Major  Year
0   George Catherine  2.680848    History     4
1       George Gates  2.837778  Chemistry     4
2        George Adam  2.860222  Chemistry     4
3     Adam Catherine  2.807550    History     4
4       George Henry  2.639549    History     4
5        Gates Frank  2.717357    History     4
6        Frank Henry  2.830181    History     4
7        Daniel Bill  2.778149    History     4
8     Catherine Bill  2.732800  Chemistry     4
9        Daniel Ewin  2.716602    History     4
10         Bill Ewin  2.786612  Chemistry     4
11        Gates Bill  2.721103    History     4
12       Henry Henry  2.817131    History     4
13      Frank George  2.819612    History     4
14         Ewin Ewin  2.826603    History     4
15    Catherine Adam  2.713949  Chemistry     4
16        Ewin Frank  2.774059  Chemistry     4
17         Adam Bill  2.908274  Chemistry     4
18       Frank Gates  2.610835    History     4
19        Henry Ewin  2.818097  Chemistry     4

In [189]:
statement = "SELECT * FROM student_data WHERE Major like '%ry' ORDER BY MAJOR;"
selected_data = sqldf(statement, globals())
print(selected_data)

                 Name       GPA      Major  Year
0         Adam George  2.746021  Chemistry     5
1          Frank Ewin  2.749638  Chemistry     2
2          Ewin Frank  2.801940  Chemistry     3
3         Issac Issac  2.890433  Chemistry     2
4          Gates Adam  2.923152  Chemistry     1
...               ...       ...        ...   ...
3297     Issac George  2.610410    History     4
3298    George George  2.608504    History     1
3299  Catherine Issac  2.704581    History     3
3300      Daniel Bill  2.725188    History     4
3301       Adam Henry  2.784513    History     5

[3302 rows x 4 columns]

In [190]:
statement = "SELECT * FROM student_data WHERE Major like '%ry' ORDER BY MAJOR DESC;"
selected_data = sqldf(statement, globals())
print(selected_data)

                  Name       GPA      Major  Year
0      Gates Catherine  2.795424    History     2
1         Henry Daniel  2.793533    History     5
2     George Catherine  2.680848    History     4
3          Issac Issac  2.819450    History     5
4           Issac Adam  2.768629    History     3
...                ...       ...        ...   ...
3297         Bill Adam  2.811791  Chemistry     5
3298        Adam Henry  2.866484  Chemistry     3
3299        Frank Ewin  2.754792  Chemistry     3
3300       George Adam  2.862292  Chemistry     1
3301       Bill Daniel  2.832558  Chemistry     1

[3302 rows x 4 columns]

In [191]:
statement = "SELECT * FROM student_data WHERE Major like '%ry' ORDER BY MAJOR, Year DESC;"
selected_data = sqldf(statement, globals())
print(selected_data)

                     Name       GPA      Major  Year
0             Adam George  2.746021  Chemistry     5
1             Frank Issac  2.873346  Chemistry     5
2            Daniel Frank  2.932845  Chemistry     5
3             Ewin Daniel  2.914165  Chemistry     5
4              Henry Adam  2.881239  Chemistry     5
...                   ...       ...        ...   ...
3297  Catherine Catherine  2.634722    History     1
3298           Bill Henry  2.724548    History     1
3299            Bill Bill  2.679061    History     1
3300         Daniel Henry  2.663381    History     1
3301        George George  2.608504    History     1

[3302 rows x 4 columns]